# “Основні структури даних”
# Опис домашнього завдання

# Завдання 2
# Необхідно розробити функцію, яка приймає рядок як вхідний параметр, додає всі його символи до двосторонньої 
# черги (deque з модуля collections в Python), а потім порівнює символи з обох кінців черги, щоб визначити, 
# чи є рядок паліндромом. Програма повинна правильно враховувати як рядки з парною, так і з непарною кількістю 
# символів, а також бути нечутливою до регістру та пробілів.

# Завдання 3 (необов'язкове завдання)
# У багатьох мовах програмування ми маємо справу з виразами, виділеними символами-розділювачами, такими як 
# круглі ( ), квадратні [ ] або фігурні дужки { }.

# Напишіть програму, яка читає рядок з послідовністю символів-розділювачів, 
# наприклад, ( ) { [ ] ( ) ( ) { } } }, і надає відповідне повідомлення, коли розділювачі симетричні, 
# несиметричні, наприклад ( ( ( ) , або коли розділювачі різних видів стоять у парі, як-от ( }.

#  💡 Використовуйте стек, щоб запам'ятати відкриті в даний момент символи-розділювачі.

# Приклад очікуваного результату:

# ( ){[ 1 ]( 1 + 3 )( ){ }}: Симетрично
# ( 23 ( 2 - 3);: Несиметрично
# ( 11 }: Несиметрично



from task1 import Bank
from task2 import is_polyndrome
from task3 import is_symmetric
   

def main() :
    # Завдання 1
    # програмa, яка імітує приймання й обробку заявок: програма має автоматично генерувати нові 
    # заявки (ідентифіковані унікальним номером або іншими даними), додавати їх до черги, а потім послідовно 
    # видаляти з черги для "обробки", імітуючи таким чином роботу сервісного центру.
        
    # Головний цикл програми:
    #     Поки користувач не вийде з програми:
    #         Виконати generate_request() для створення нових заявок
    #         Виконати process_request() для обробки заявок
    print("Task 1 started")

    bank = Bank()

    for i in range(5):
        bank.generate_request("request" + str(i))

    bank.process_request()

    # Завдання 2
    # Необхідно розробити функцію, яка приймає рядок як вхідний параметр, додає всі його символи до двосторонньої 
    # черги (deque з модуля collections в Python), а потім порівнює символи з обох кінців черги, щоб визначити, 
    # чи є рядок паліндромом. Програма повинна правильно враховувати як рядки з парною, так і з непарною кількістю 
    # символів, а також бути нечутливою до регістру та пробілів.

    print("Task 2 started")

    while True:
        if (is_polyndrome(input("Enter any string. I'll check wether it is palindrome or not:"))):
            print("Yes, it is palindrome")
        else:
            print("No, it is not palindrome")

        if "N" == (input("Would you like to try again? (Y/N)")).upper():
            break

    # Завдання 3 (необов'язкове завдання)
    # У багатьох мовах програмування ми маємо справу з виразами, виділеними символами-розділювачами, такими як 
    # круглі ( ), квадратні [ ] або фігурні дужки { }.
    # Напишіть програму, яка читає рядок з послідовністю символів-розділювачів, 
    # наприклад, ( ) { [ ] ( ) ( ) { } } }, і надає відповідне повідомлення, коли розділювачі симетричні, 
    # несиметричні, наприклад ( ( ( ) , або коли розділювачі різних видів стоять у парі, як-от ( }.
    print("Task 3 started")

    while True:
            expression = input("Enter an expression: ")
            print(f"{expression}: {is_symmetric(expression)}")
            if "N" == (input("Would you like to try again? (Y/N)")).upper():
                break


if __name__=='__main__':

    main()